/* package up error # */
"error %1$d" = "errore %1$d";
"error %1$#x" = "errore %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Errore sconosciuto: 0";

/* errno error 1 */
"Operation not permitted" = "Operazione non permessa";

/* errno error 2 */
"No such file or directory" = "Nessun documento o directory esistente";

/* errno error 3 */
"No such process" = "Nessun processo esistente";

/* errno error 4 */
"Interrupted system call" = "Chiamata sistema interrotta";

/* errno error 5 */
"Input/output error" = "Errore di input/output";

/* errno error 6 */
"Device not configured" = "Dispositivo non configurato";

/* errno error 7 */
"Argument list too long" = "Elenco argomenti troppo lungo";

/* errno error 8 */
"Exec format error" = "Errore formato eseguibile";

/* errno error 9 */
"Bad file descriptor" = "Descrittore del documento non valido";

/* errno error 10 */
"No child processes" = "Nessun processo figlio";

/* errno error 11 */
"Resource deadlock avoided" = "Blocco risorsa evitato";

/* errno error 12 */
"Cannot allocate memory" = "Impossibile allocare memoria";

/* errno error 13 */
"Permission denied" = "Permesso negato";

/* errno error 14 */
"Bad address" = "Indirizzo non valido";

/* errno error 15 */
"Block device required" = "Blocco dispositivo necessario";

/* errno error 16 */
"Resource busy" = "Risorsa occupata";

/* errno error 17 */
"File exists" = "Il documento esiste";

/* errno error 18 */
"Cross-device link" = "Link cross-device";

/* errno error 19 */
"Operation not supported by device" = "Operazione non supportata dal dispositivo";

/* errno error 20 */
"Not a directory" = "Non è una directory";

/* errno error 21 */
"Is a directory" = "È una directory";

/* errno error 22 */
"Invalid argument" = "Argomento non valido";

/* errno error 23 */
"Too many open files in system" = "Troppi file aperti nel sistema";

/* errno error 24 */
"Too many open files" = "Troppi file aperti";

/* errno error 25 */
"Inappropriate ioctl for device" = "Ioctl inappropriato per dispositivo";

/* errno error 26 */
"Text file busy" = "Documento di testo occupato";

/* errno error 27 */
"File too large" = "Documento troppo grande";

/* errno error 28 */
"No space left on device" = "Spazio esaurito sul dispositivo";

/* errno error 29 */
"Illegal seek" = "Seek illegale";

/* errno error 30 */
"Read-only file system" = "File system di sola lettura";

/* errno error 31 */
"Too many links" = "Troppi link";

/* errno error 32 */
"Broken pipe" = "Pipe interrotto";

/* errno error 33 */
"Numerical argument out of domain" = "Argomento numerico fuori dominio";

/* errno error 34 */
"Result too large" = "Risultato troppo lungo";

/* errno error 35 */
"Resource temporarily unavailable" = "Risorsa momentaneamente non disponibile";

/* errno error 36 */
"Operation now in progress" = "Operazione attualmente in corso";

/* errno error 37 */
"Operation already in progress" = "Operazione già in corso";

/* errno error 38 */
"Socket operation on non-socket" = "Operazione socket su non-socket";

/* errno error 39 */
"Destination address required" = "Indirizzo destinazione richiesto";

/* errno error 40 */
"Message too long" = "Messaggio troppo lungo";

/* errno error 41 */
"Protocol wrong type for socket" = "Tipo errato di protocollo per il socket";

/* errno error 42 */
"Protocol not available" = "Protocollo non disponibile";

/* errno error 43 */
"Protocol not supported" = "Protocollo non supportato";

/* errno error 44 */
"Socket type not supported" = "Tipo di socket non supportato";

/* errno error 45 */
"Operation not supported" = "Operazione non supportata";

/* errno error 46 */
"Protocol family not supported" = "Famiglia protocollo non supportata";

/* errno error 47 */
"Address family not supported by protocol family" = "Famiglia indirizzi non supportata dalla famiglia di protocollo";

/* errno error 48 */
"Address already in use" = "Indirizzo già in uso";

/* errno error 49 */
"Can't assign requested address" = "Impossibile assegnare l'indirizzo richiesto";

/* errno error 50 */
"Network is down" = "Il Network non è in funzione";

/* errno error 51 */
"Network is unreachable" = "Il Network non è raggiungibile";

/* errno error 52 */
"Network dropped connection on reset" = "Il Network ha interrotto la connessione durante la reinizializzazione";

/* errno error 53 */
"Software caused connection abort" = "Il software ha provocato l'interruzione della connessione";

/* errno error 54 */
"Connection reset by peer" = "Connessione reinizializzata dal destinatario";

/* errno error 55 */
"No buffer space available" = "Spazio esaurito nel buffer";

/* errno error 56 */
"Socket is already connected" = "Il socket è già collegato";

/* errno error 57 */
"Socket is not connected" = "Il socket non è collegato";

/* errno error 58 */
"Can't send after socket shutdown" = "Impossibile inviare dopo lo spegnimento socket";

/* errno error 59 */
"Too many references: can't splice" = "Troppi riferimenti: impossibile collegare";

/* errno error 60 */
"Operation timed out" = "Tempo scaduto per l'operazione";

/* errno error 61 */
"Connection refused" = "Connessione rifiutata";

/* errno error 62 */
"Too many levels of symbolic links" = "Troppi livelli di link simbolici";

/* errno error 63 */
"File name too long" = "Nome del documento troppo lungo";

/* errno error 64 */
"Host is down" = "L'host non è in funzione";

/* errno error 65 */
"No route to host" = "L'host è irraggiungibile";

/* errno error 66 */
"Directory not empty" = "Directory non vuota";

/* errno error 67 */
"Too many processes" = "Troppi processi";

/* errno error 68 */
"Too many users" = "Troppi utenti";

/* errno error 69 */
"Disc quota exceeded" = "Superata la quota disco";

/* errno error 70 */
"Stale NFS file handle" = "Handle documento NFS scaduto";

/* errno error 71 */
"Too many levels of remote in path" = "Troppi livelli di percorso remoti";

/* errno error 72 */
"RPC struct is bad" = "Struttura RPC non valida";

/* errno error 73 */
"RPC version wrong" = "Errata versione RPC";

/* errno error 74 */
"RPC prog. not avail" = "Programma RPC non disponibile";

/* errno error 75 */
"Program version wrong" = "Errata versione del programma";

/* errno error 76 */
"Bad procedure for program" = "Procedura non valida per il programma";

/* errno error 77 */
"No locks available" = "Nessun lock disponibile";

/* errno error 78 */
"Function not implemented" = "Funzione non implementata";

/* errno error 79 */
"Inappropriate file type or format" = "Tipo di documento o formato inappropriato";

/* errno error 80 */
"Authentication error" = "Errore di autenticazione";

/* errno error 81 */
"Need authenticator" = "Occorre autenticatore";

/* errno error 82 */
"Device power is off" = "Interruttore dispositivo spento";

/* errno error 83 */
"Device error" = "Errore del dispositivo";

/* errno error 84 */
"Value too large to be stored in data type" = "Valore troppo lungo per archiviarlo nel tipo di dati";

/* errno error 85 */
"Bad executable (or shared library)" = "Eseguibile (o libreria condivisa) non valido";

/* errno error 86 */
"Bad CPU type in executable" = "Tipo CPU non valido nell'eseguibile";

/* errno error 87 */
"Shared library version mismatch" = "Versione errata libreria condivisa";

/* errno error 88 */
"Malformed Mach-o file" = "Documento Mach-o non conforme";

/* errno error 89 */
"Operation canceled" = "Operazione annullata";

/* errno error 90 */
"Identifier removed" = "Identificatore rimosso";

/* errno error 91 */
"No message of desired type" = "Nessun messaggio del tipo desiderato";

/* errno error 92 */
"Illegal byte sequence" = "Sequenza di byte non valida";

/* errno error 93 */
"Attribute not found" = "Attributo non trovato";

/* errno error 94 */
"Bad message" = "Messaggio errato";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (Riservato)";

/* errno error 96 */
"No message available on STREAM" = "Nessun messaggio disponibile su STREAM";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (Riservato)";

/* errno error 98 */
"No STREAM resources" = "Nessuna risorsa STREAM";

/* errno error 99 */
"Not a STREAM" = "Non è uno STREAM";

/* errno error 100 */
"Protocol error" = "Errore protocollo";

/* errno error 101 */
"STREAM ioctl timeout" = "Timeout ioctl STREAM";

/* errno error 102 */
"Operation not supported on socket" = "Operazione non supportata su socket";

/* errno error 103 */
"Policy not found" = "Politica non trovata";
